Revit 2027 API
ParameterTypeId.FabricationProductDataInstallType Property
 "Install Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductDataInstallType { get; }
Public Shared ReadOnly Property FabricationProductDataInstallType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductDataInstallType {
	ForgeTypeId^ get ();
}
static member FabricationProductDataInstallType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace